malishav/openwsn-fw/bsp/boards/nrf52840/board_info.h
/**
 * Author: Tamas Harczos (tamas.harczos@imms.de)
 * Date:   Apr 2018
 * Description: nRF52840-specific board information bsp module.
 */

#ifndef __BOARD_INFO_H
#define __BOARD_INFO_H

#include <stdint.h>
#include <string.h>

#include "sdk/modules/nrfx/templates/nRF52840/nrfx_config.h"


//=========================== defines =========================================

#ifndef TRUE
#define TRUE 1
#endif

#ifndef FALSE
#define FALSE 0
#endif

#define E_FAIL          (-1)
#define E_SUCCESS       (0)

//===== interrupt state

#define INTERRUPT_DECLARATION()
#define DISABLE_INTERRUPTS() __asm volatile ("cpsid i" : : : "memory")    ///< or use __disable_irq() from core_cmFunc.h
#define ENABLE_INTERRUPTS() __asm volatile ("cpsie i" : : : "memory")     ///< or use __enable_irq() from core_cmFunc.h

//===== timer

#define PORT_TIMER_WIDTH                    uint32_t      ///< actually, 24 bit, but we will virtualize the 32 bit timer
#define PORT_RADIOTIMER_WIDTH               uint32_t

#define PORT_SIGNED_INT_WIDTH               int32_t
#define PORT_TICS_PER_MS                    33
#define PORT_US_PER_TICK                    30  // number of us per 32kHz clock tick

// on GINA, we use the comparatorA interrupt for the OS
#define SCHEDULER_WAKEUP()
#define SCHEDULER_ENABLE_INTERRUPT()

// this is a workaround from the fact that the interrupt pin for the GINA radio
// is not connected to a pin on the MSP which allows time capture.
#define CAPTURE_TIME()

//===== IEEE802154E timing
// 1 clock tick = 30.5 us

#define SLOTDURATION 20 // in miliseconds

#if SLOTDURATION==10
    // time-slot related
    #define PORT_TsSlotDuration                 328   // counter counts one extra count, see datasheet

#if BOARD_PCA10056
// nrf52840-DK
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 364us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 364us)

    // radio speed related
    #define PORT_delayTx                        10    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         5    // ~153us (measured 147us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif
#if BOARD_PCA10059
// nrf52840-DONGLE
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 345us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 345us)

    // radio speed related
    #define PORT_delayTx                        10    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         5    // ~153us (measured 136us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif

#endif // SLOTDURATION==10

#if SLOTDURATION==15
    // time-slot related
    #define PORT_TsSlotDuration                 492   // counter counts one extra count, see datasheet

#if BOARD_PCA10056
// nrf52840-DK
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 364us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 364us)

    // radio speed related
    #define PORT_delayTx                        10    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         5    // ~153us (measured 147us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif
#if BOARD_PCA10059
// nrf52840-DONGLE
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 345us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 345us)

    // radio speed related
    #define PORT_delayTx                        10    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         5    // ~153us (measured 136us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif

#endif // SLOTDURATION==15


#if SLOTDURATION==20
    // time-slot related
    #define PORT_TsSlotDuration                 656   // counter counts one extra count, see datasheet

#if BOARD_PCA10056
// nrf52840-DK
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 364us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 364us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 364us)

    // radio speed related
    #define PORT_delayTx                         1    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         0    // ~153us (measured 147us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif
#if BOARD_PCA10059
// nrf52840-DONGLE
    #define PORT_maxTxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxRxAckPrepare                13    // ~397us (measured 345us)
    #define PORT_maxRxDataPrepare               13    // ~397us (measured 345us)
    #define PORT_maxTxAckPrepare                13    // ~397us (measured 345us)

    // radio speed related
    #define PORT_delayTx                        10    //  305us (measured 282us; radio_txNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
    #define PORT_delayRx                         5    // ~153us (measured 136us; radio_rxNow() to RADIO_IRQHandler() / NRF_RADIO->EVENTS_READY)
#endif

#endif // SLOTDURATION==20

//===== adaptive_sync accuracy

#define SYNC_ACCURACY                            1     // ticks

//===== per-board number of sensors

#define NUMSENSORS 2

//=========================== typedef  ========================================

//=========================== variables =======================================

static const uint8_t rreg_uriquery[]        = "h=ucb";
static const uint8_t infoBoardname[]        = "nRF52840";
static const uint8_t infouCName[]           = "nRF52840";
static const uint8_t infoRadioName[]        = "nRF52840 SoC";

//=========================== prototypes ======================================

//=========================== public ==========================================

//=========================== private =========================================

#endif
